In [1]:
import pandas as pd
import sqlalchemy as sl

In [8]:
engine=sl.create_engine("mysql+pymysql://root:@localhost:3306/practice")

In [9]:
df=pd.read_sql_table("school",engine)

In [10]:
df

   id    name  marks
0   1  Ritika     98
1   2  Ritika     98
2   3     Ayu     98
3   4    iska     88
4   5    Riti     90
5   6    Rita     90
6   7  kitika     68
7   8    pika     49
8   9    kika     91

In [12]:
df=pd.read_sql_table("school",engine,columns=["id","name"])
df

   id    name
0   1  Ritika
1   2  Ritika
2   3     Ayu
3   4    iska
4   5    Riti
5   6    Rita
6   7  kitika
7   8    pika
8   9    kika

In [16]:
q="select * from school where id in (1,2,3);"
df=pd.read_sql_query(q,engine)
df

   id    name  marks
0   1  Ritika     98
1   2  Ritika     98
2   3     Ayu     98

In [18]:
# write data into sql
df=pd.read_excel("C:/Users/Riya/Downloads/PhoneNums.xlsx")
df

     Name  Phone Number
0  Ritika     985373428
1    Rits     985373429
2    Riya     985373430
3    Rori     985373431
4    Riri     985373432
5  Riroru     985373433

In [19]:
df.rename(columns={"Name":"name","Phone Number":"ph_num"},inplace=True)
df

     name     ph_num
0  Ritika  985373428
1    Rits  985373429
2    Riya  985373430
3    Rori  985373431
4    Riri  985373432
5  Riroru  985373433

In [21]:
df.to_sql(name="student",con=engine,index=False,if_exists="append")

6